<details>
<summary>Execution result of "run-all plan" in "live-infrastructure/cuenta2/us-east-1"</summary>

```terraform
03:11:08.422 INFO   The stack at /github/workspace/live-infrastructure/cuenta2/us-east-1 will be processed in the following order for command plan:
Group 1
- Module vpc


03:11:12.723 STDOUT [vpc] terraform: Terraform used the selected providers to generate the following execution
03:11:12.723 STDOUT [vpc] terraform: plan. Resource actions are indicated with the following symbols:
03:11:12.723 STDOUT [vpc] terraform:   + create
03:11:12.723 STDOUT [vpc] terraform: Terraform will perform the following actions:
03:11:12.723 STDOUT [vpc] terraform:   # aws_default_network_acl.this[0] will be created
03:11:12.723 STDOUT [vpc] terraform:   + resource "aws_default_network_acl" "this" {
03:11:12.723 STDOUT [vpc] terraform:       + arn                    = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + default_network_acl_id = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + id                     = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + owner_id               = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + tags                   = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-default"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + tags_all               = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-default"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + vpc_id                 = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + egress {
03:11:12.723 STDOUT [vpc] terraform:           + action          = "allow"
03:11:12.723 STDOUT [vpc] terraform:           + from_port       = 0
03:11:12.723 STDOUT [vpc] terraform:           + ipv6_cidr_block = "::/0"
03:11:12.723 STDOUT [vpc] terraform:           + protocol        = "-1"
03:11:12.723 STDOUT [vpc] terraform:           + rule_no         = 101
03:11:12.723 STDOUT [vpc] terraform:           + to_port         = 0
03:11:12.723 STDOUT [vpc] terraform:             # (1 unchanged attribute hidden)
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + egress {
03:11:12.723 STDOUT [vpc] terraform:           + action          = "allow"
03:11:12.723 STDOUT [vpc] terraform:           + cidr_block      = "0.0.0.0/0"
03:11:12.723 STDOUT [vpc] terraform:           + from_port       = 0
03:11:12.723 STDOUT [vpc] terraform:           + protocol        = "-1"
03:11:12.723 STDOUT [vpc] terraform:           + rule_no         = 100
03:11:12.723 STDOUT [vpc] terraform:           + to_port         = 0
03:11:12.723 STDOUT [vpc] terraform:             # (1 unchanged attribute hidden)
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + ingress {
03:11:12.723 STDOUT [vpc] terraform:           + action          = "allow"
03:11:12.723 STDOUT [vpc] terraform:           + from_port       = 0
03:11:12.723 STDOUT [vpc] terraform:           + ipv6_cidr_block = "::/0"
03:11:12.723 STDOUT [vpc] terraform:           + protocol        = "-1"
03:11:12.723 STDOUT [vpc] terraform:           + rule_no         = 101
03:11:12.723 STDOUT [vpc] terraform:           + to_port         = 0
03:11:12.723 STDOUT [vpc] terraform:             # (1 unchanged attribute hidden)
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + ingress {
03:11:12.723 STDOUT [vpc] terraform:           + action          = "allow"
03:11:12.723 STDOUT [vpc] terraform:           + cidr_block      = "0.0.0.0/0"
03:11:12.723 STDOUT [vpc] terraform:           + from_port       = 0
03:11:12.723 STDOUT [vpc] terraform:           + protocol        = "-1"
03:11:12.723 STDOUT [vpc] terraform:           + rule_no         = 100
03:11:12.723 STDOUT [vpc] terraform:           + to_port         = 0
03:11:12.723 STDOUT [vpc] terraform:             # (1 unchanged attribute hidden)
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:     }
03:11:12.723 STDOUT [vpc] terraform:   # aws_default_route_table.default[0] will be created
03:11:12.723 STDOUT [vpc] terraform:   + resource "aws_default_route_table" "default" {
03:11:12.723 STDOUT [vpc] terraform:       + arn                    = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + default_route_table_id = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + id                     = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + owner_id               = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + route                  = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + tags                   = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-default"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + tags_all               = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-default"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + vpc_id                 = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + timeouts {
03:11:12.723 STDOUT [vpc] terraform:           + create = "5m"
03:11:12.723 STDOUT [vpc] terraform:           + update = "5m"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:     }
03:11:12.723 STDOUT [vpc] terraform:   # aws_default_security_group.this[0] will be created
03:11:12.723 STDOUT [vpc] terraform:   + resource "aws_default_security_group" "this" {
03:11:12.723 STDOUT [vpc] terraform:       + arn                    = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + description            = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + egress                 = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + id                     = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + ingress                = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + name                   = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + name_prefix            = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + owner_id               = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + revoke_rules_on_delete = false
03:11:12.723 STDOUT [vpc] terraform:       + tags                   = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-default"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + tags_all               = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-default"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + vpc_id                 = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:     }
03:11:12.723 STDOUT [vpc] terraform:   # aws_internet_gateway.this[0] will be created
03:11:12.723 STDOUT [vpc] terraform:   + resource "aws_internet_gateway" "this" {
03:11:12.723 STDOUT [vpc] terraform:       + arn      = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + id       = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + owner_id = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:       + tags     = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + tags_all = {
03:11:12.723 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.723 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.723 STDOUT [vpc] terraform:           + "Name"        = "my-vpc"
03:11:12.723 STDOUT [vpc] terraform:         }
03:11:12.723 STDOUT [vpc] terraform:       + vpc_id   = (known after apply)
03:11:12.723 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route.public_internet_gateway[0] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route" "public_internet_gateway" {
03:11:12.726 STDOUT [vpc] terraform:       + destination_cidr_block = "0.0.0.0/0"
03:11:12.726 STDOUT [vpc] terraform:       + gateway_id             = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + id                     = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + instance_id            = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + instance_owner_id      = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + network_interface_id   = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + origin                 = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route_table_id         = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + state                  = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + timeouts {
03:11:12.726 STDOUT [vpc] terraform:           + create = "5m"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table.private[0] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table" "private" {
03:11:12.726 STDOUT [vpc] terraform:       + arn              = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + id               = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + owner_id         = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + propagating_vgws = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route            = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + tags             = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1a"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + tags_all         = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1a"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + vpc_id           = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table.private[1] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table" "private" {
03:11:12.726 STDOUT [vpc] terraform:       + arn              = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + id               = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + owner_id         = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + propagating_vgws = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route            = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + tags             = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1b"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + tags_all         = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1b"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + vpc_id           = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table.private[2] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table" "private" {
03:11:12.726 STDOUT [vpc] terraform:       + arn              = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + id               = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + owner_id         = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + propagating_vgws = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route            = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + tags             = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1c"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + tags_all         = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1c"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + vpc_id           = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table.public[0] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table" "public" {
03:11:12.726 STDOUT [vpc] terraform:       + arn              = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + id               = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + owner_id         = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + propagating_vgws = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route            = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + tags             = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + tags_all         = {
03:11:12.726 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.726 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.726 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public"
03:11:12.726 STDOUT [vpc] terraform:         }
03:11:12.726 STDOUT [vpc] terraform:       + vpc_id           = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table_association.private[0] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table_association" "private" {
03:11:12.726 STDOUT [vpc] terraform:       + id             = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route_table_id = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + subnet_id      = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table_association.private[1] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table_association" "private" {
03:11:12.726 STDOUT [vpc] terraform:       + id             = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + route_table_id = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:       + subnet_id      = (known after apply)
03:11:12.726 STDOUT [vpc] terraform:     }
03:11:12.726 STDOUT [vpc] terraform:   # aws_route_table_association.private[2] will be created
03:11:12.726 STDOUT [vpc] terraform:   + resource "aws_route_table_association" "private" {
03:11:12.727 STDOUT [vpc] terraform:       + id             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + route_table_id = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + subnet_id      = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_route_table_association.public[0] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_route_table_association" "public" {
03:11:12.727 STDOUT [vpc] terraform:       + id             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + route_table_id = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + subnet_id      = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_route_table_association.public[1] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_route_table_association" "public" {
03:11:12.727 STDOUT [vpc] terraform:       + id             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + route_table_id = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + subnet_id      = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_route_table_association.public[2] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_route_table_association" "public" {
03:11:12.727 STDOUT [vpc] terraform:       + id             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + route_table_id = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + subnet_id      = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_subnet.private[0] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_subnet" "private" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + assign_ipv6_address_on_creation                = false
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone                              = "us-east-1a"
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone_id                           = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                                     = "10.0.1.0/24"
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns64                                   = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.727 STDOUT [vpc] terraform:       + id                                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_native                                    = false
03:11:12.727 STDOUT [vpc] terraform:       + map_public_ip_on_launch                        = false
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                                       = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                           = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1a"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                                       = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1a"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + vpc_id                                         = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_subnet.private[1] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_subnet" "private" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + assign_ipv6_address_on_creation                = false
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone                              = "us-east-1b"
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone_id                           = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                                     = "10.0.2.0/24"
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns64                                   = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.727 STDOUT [vpc] terraform:       + id                                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_native                                    = false
03:11:12.727 STDOUT [vpc] terraform:       + map_public_ip_on_launch                        = false
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                                       = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                           = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1b"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                                       = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1b"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + vpc_id                                         = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_subnet.private[2] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_subnet" "private" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + assign_ipv6_address_on_creation                = false
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone                              = "us-east-1c"
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone_id                           = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                                     = "10.0.3.0/24"
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns64                                   = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.727 STDOUT [vpc] terraform:       + id                                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_native                                    = false
03:11:12.727 STDOUT [vpc] terraform:       + map_public_ip_on_launch                        = false
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                                       = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                           = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1c"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                                       = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-private-us-east-1c"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + vpc_id                                         = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_subnet.public[0] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_subnet" "public" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + assign_ipv6_address_on_creation                = false
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone                              = "us-east-1a"
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone_id                           = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                                     = "10.0.101.0/24"
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns64                                   = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.727 STDOUT [vpc] terraform:       + id                                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_native                                    = false
03:11:12.727 STDOUT [vpc] terraform:       + map_public_ip_on_launch                        = false
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                                       = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                           = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public-us-east-1a"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                                       = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public-us-east-1a"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + vpc_id                                         = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_subnet.public[1] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_subnet" "public" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + assign_ipv6_address_on_creation                = false
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone                              = "us-east-1b"
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone_id                           = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                                     = "10.0.102.0/24"
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns64                                   = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.727 STDOUT [vpc] terraform:       + id                                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_native                                    = false
03:11:12.727 STDOUT [vpc] terraform:       + map_public_ip_on_launch                        = false
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                                       = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                           = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public-us-east-1b"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                                       = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public-us-east-1b"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + vpc_id                                         = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_subnet.public[2] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_subnet" "public" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + assign_ipv6_address_on_creation                = false
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone                              = "us-east-1c"
03:11:12.727 STDOUT [vpc] terraform:       + availability_zone_id                           = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                                     = "10.0.104.0/24"
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns64                                   = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.727 STDOUT [vpc] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.727 STDOUT [vpc] terraform:       + id                                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_native                                    = false
03:11:12.727 STDOUT [vpc] terraform:       + map_public_ip_on_launch                        = false
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                                       = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                           = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public-us-east-1c"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                                       = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc-public-us-east-1c"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + vpc_id                                         = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform:   # aws_vpc.this[0] will be created
03:11:12.727 STDOUT [vpc] terraform:   + resource "aws_vpc" "this" {
03:11:12.727 STDOUT [vpc] terraform:       + arn                                  = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + cidr_block                           = "10.0.0.0/16"
03:11:12.727 STDOUT [vpc] terraform:       + default_network_acl_id               = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + default_route_table_id               = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + default_security_group_id            = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + dhcp_options_id                      = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns_hostnames                 = true
03:11:12.727 STDOUT [vpc] terraform:       + enable_dns_support                   = true
03:11:12.727 STDOUT [vpc] terraform:       + enable_network_address_usage_metrics = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + id                                   = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + instance_tenancy                     = "default"
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_association_id                  = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block                      = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + main_route_table_id                  = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + owner_id                             = (known after apply)
03:11:12.727 STDOUT [vpc] terraform:       + tags                                 = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:       + tags_all                             = {
03:11:12.727 STDOUT [vpc] terraform:           + "Environment" = "dev"
03:11:12.727 STDOUT [vpc] terraform:           + "IaC"         = "true"
03:11:12.727 STDOUT [vpc] terraform:           + "Name"        = "my-vpc"
03:11:12.727 STDOUT [vpc] terraform:         }
03:11:12.727 STDOUT [vpc] terraform:     }
03:11:12.727 STDOUT [vpc] terraform: Plan: 22 to add, 0 to change, 0 to destroy.
03:11:12.728 STDOUT [vpc] terraform: 
03:11:12.728 STDOUT [vpc] terraform: Changes to Outputs:
03:11:12.728 STDOUT [vpc] terraform:   + azs                                         = [
03:11:12.728 STDOUT [vpc] terraform:       + "us-east-1a",
03:11:12.728 STDOUT [vpc] terraform:       + "us-east-1b",
03:11:12.728 STDOUT [vpc] terraform:       + "us-east-1c",
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + cgw_arns                                    = []
03:11:12.728 STDOUT [vpc] terraform:   + cgw_ids                                     = []
03:11:12.728 STDOUT [vpc] terraform:   + database_nat_gateway_route_ids              = []
03:11:12.728 STDOUT [vpc] terraform:   + database_route_table_association_ids        = []
03:11:12.728 STDOUT [vpc] terraform:   + database_route_table_ids                    = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + database_subnet_arns                        = []
03:11:12.728 STDOUT [vpc] terraform:   + database_subnet_objects                     = []
03:11:12.728 STDOUT [vpc] terraform:   + database_subnets                            = []
03:11:12.728 STDOUT [vpc] terraform:   + database_subnets_cidr_blocks                = []
03:11:12.728 STDOUT [vpc] terraform:   + database_subnets_ipv6_cidr_blocks           = []
03:11:12.728 STDOUT [vpc] terraform:   + default_network_acl_id                      = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + default_route_table_id                      = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + default_security_group_id                   = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_route_table_association_ids     = []
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_route_table_ids                 = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_subnet_arns                     = []
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_subnet_objects                  = []
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_subnets                         = []
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_subnets_cidr_blocks             = []
03:11:12.728 STDOUT [vpc] terraform:   + elasticache_subnets_ipv6_cidr_blocks        = []
03:11:12.728 STDOUT [vpc] terraform:   + igw_arn                                     = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + igw_id                                      = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + intra_route_table_association_ids           = []
03:11:12.728 STDOUT [vpc] terraform:   + intra_route_table_ids                       = []
03:11:12.728 STDOUT [vpc] terraform:   + intra_subnet_arns                           = []
03:11:12.728 STDOUT [vpc] terraform:   + intra_subnet_objects                        = []
03:11:12.728 STDOUT [vpc] terraform:   + intra_subnets                               = []
03:11:12.728 STDOUT [vpc] terraform:   + intra_subnets_cidr_blocks                   = []
03:11:12.728 STDOUT [vpc] terraform:   + intra_subnets_ipv6_cidr_blocks              = []
03:11:12.728 STDOUT [vpc] terraform:   + name                                        = "my-vpc"
03:11:12.728 STDOUT [vpc] terraform:   + nat_ids                                     = []
03:11:12.728 STDOUT [vpc] terraform:   + nat_public_ips                              = []
03:11:12.728 STDOUT [vpc] terraform:   + natgw_ids                                   = []
03:11:12.728 STDOUT [vpc] terraform:   + natgw_interface_ids                         = []
03:11:12.728 STDOUT [vpc] terraform:   + outpost_subnet_arns                         = []
03:11:12.728 STDOUT [vpc] terraform:   + outpost_subnet_objects                      = []
03:11:12.728 STDOUT [vpc] terraform:   + outpost_subnets                             = []
03:11:12.728 STDOUT [vpc] terraform:   + outpost_subnets_cidr_blocks                 = []
03:11:12.728 STDOUT [vpc] terraform:   + outpost_subnets_ipv6_cidr_blocks            = []
03:11:12.728 STDOUT [vpc] terraform:   + private_ipv6_egress_route_ids               = []
03:11:12.728 STDOUT [vpc] terraform:   + private_nat_gateway_route_ids               = []
03:11:12.728 STDOUT [vpc] terraform:   + private_route_table_association_ids         = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + private_route_table_ids                     = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + private_subnet_arns                         = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + private_subnet_objects                      = [
03:11:12.728 STDOUT [vpc] terraform:       + {
03:11:12.728 STDOUT [vpc] terraform:           + arn                                            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + assign_ipv6_address_on_creation                = false
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone                              = "us-east-1a"
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone_id                           = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + cidr_block                                     = "10.0.1.0/24"
03:11:12.728 STDOUT [vpc] terraform:           + customer_owned_ipv4_pool                       = null
03:11:12.728 STDOUT [vpc] terraform:           + enable_dns64                                   = false
03:11:12.728 STDOUT [vpc] terraform:           + enable_lni_at_device_index                     = null
03:11:12.728 STDOUT [vpc] terraform:           + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.728 STDOUT [vpc] terraform:           + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.728 STDOUT [vpc] terraform:           + id                                             = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_cidr_block                                = null
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_native                                    = false
03:11:12.728 STDOUT [vpc] terraform:           + map_customer_owned_ip_on_launch                = null
03:11:12.728 STDOUT [vpc] terraform:           + map_public_ip_on_launch                        = false
03:11:12.728 STDOUT [vpc] terraform:           + outpost_arn                                    = null
03:11:12.728 STDOUT [vpc] terraform:           + owner_id                                       = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + tags                                           = {
03:11:12.728 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.728 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.728 STDOUT [vpc] terraform:               + Name        = "my-vpc-private-us-east-1a"
03:11:12.728 STDOUT [vpc] terraform:             }
03:11:12.728 STDOUT [vpc] terraform:           + tags_all                                       = {
03:11:12.728 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.728 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.728 STDOUT [vpc] terraform:               + Name        = "my-vpc-private-us-east-1a"
03:11:12.728 STDOUT [vpc] terraform:             }
03:11:12.728 STDOUT [vpc] terraform:           + timeouts                                       = null
03:11:12.728 STDOUT [vpc] terraform:           + vpc_id                                         = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:         },
03:11:12.728 STDOUT [vpc] terraform:       + {
03:11:12.728 STDOUT [vpc] terraform:           + arn                                            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + assign_ipv6_address_on_creation                = false
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone                              = "us-east-1b"
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone_id                           = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + cidr_block                                     = "10.0.2.0/24"
03:11:12.728 STDOUT [vpc] terraform:           + customer_owned_ipv4_pool                       = null
03:11:12.728 STDOUT [vpc] terraform:           + enable_dns64                                   = false
03:11:12.728 STDOUT [vpc] terraform:           + enable_lni_at_device_index                     = null
03:11:12.728 STDOUT [vpc] terraform:           + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.728 STDOUT [vpc] terraform:           + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.728 STDOUT [vpc] terraform:           + id                                             = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_cidr_block                                = null
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_native                                    = false
03:11:12.728 STDOUT [vpc] terraform:           + map_customer_owned_ip_on_launch                = null
03:11:12.728 STDOUT [vpc] terraform:           + map_public_ip_on_launch                        = false
03:11:12.728 STDOUT [vpc] terraform:           + outpost_arn                                    = null
03:11:12.728 STDOUT [vpc] terraform:           + owner_id                                       = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + tags                                           = {
03:11:12.728 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.728 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.728 STDOUT [vpc] terraform:               + Name        = "my-vpc-private-us-east-1b"
03:11:12.728 STDOUT [vpc] terraform:             }
03:11:12.728 STDOUT [vpc] terraform:           + tags_all                                       = {
03:11:12.728 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.728 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.728 STDOUT [vpc] terraform:               + Name        = "my-vpc-private-us-east-1b"
03:11:12.728 STDOUT [vpc] terraform:             }
03:11:12.728 STDOUT [vpc] terraform:           + timeouts                                       = null
03:11:12.728 STDOUT [vpc] terraform:           + vpc_id                                         = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:         },
03:11:12.728 STDOUT [vpc] terraform:       + {
03:11:12.728 STDOUT [vpc] terraform:           + arn                                            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + assign_ipv6_address_on_creation                = false
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone                              = "us-east-1c"
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone_id                           = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + cidr_block                                     = "10.0.3.0/24"
03:11:12.728 STDOUT [vpc] terraform:           + customer_owned_ipv4_pool                       = null
03:11:12.728 STDOUT [vpc] terraform:           + enable_dns64                                   = false
03:11:12.728 STDOUT [vpc] terraform:           + enable_lni_at_device_index                     = null
03:11:12.728 STDOUT [vpc] terraform:           + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.728 STDOUT [vpc] terraform:           + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.728 STDOUT [vpc] terraform:           + id                                             = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_cidr_block                                = null
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + ipv6_native                                    = false
03:11:12.728 STDOUT [vpc] terraform:           + map_customer_owned_ip_on_launch                = null
03:11:12.728 STDOUT [vpc] terraform:           + map_public_ip_on_launch                        = false
03:11:12.728 STDOUT [vpc] terraform:           + outpost_arn                                    = null
03:11:12.728 STDOUT [vpc] terraform:           + owner_id                                       = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + tags                                           = {
03:11:12.728 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.728 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.728 STDOUT [vpc] terraform:               + Name        = "my-vpc-private-us-east-1c"
03:11:12.728 STDOUT [vpc] terraform:             }
03:11:12.728 STDOUT [vpc] terraform:           + tags_all                                       = {
03:11:12.728 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.728 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.728 STDOUT [vpc] terraform:               + Name        = "my-vpc-private-us-east-1c"
03:11:12.728 STDOUT [vpc] terraform:             }
03:11:12.728 STDOUT [vpc] terraform:           + timeouts                                       = null
03:11:12.728 STDOUT [vpc] terraform:           + vpc_id                                         = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:         },
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + private_subnets                             = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + private_subnets_cidr_blocks                 = [
03:11:12.728 STDOUT [vpc] terraform:       + "10.0.1.0/24",
03:11:12.728 STDOUT [vpc] terraform:       + "10.0.2.0/24",
03:11:12.728 STDOUT [vpc] terraform:       + "10.0.3.0/24",
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + private_subnets_ipv6_cidr_blocks            = []
03:11:12.728 STDOUT [vpc] terraform:   + public_internet_gateway_route_id            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:   + public_route_table_association_ids          = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + public_route_table_ids                      = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + public_subnet_arns                          = [
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.728 STDOUT [vpc] terraform:     ]
03:11:12.728 STDOUT [vpc] terraform:   + public_subnet_objects                       = [
03:11:12.728 STDOUT [vpc] terraform:       + {
03:11:12.728 STDOUT [vpc] terraform:           + arn                                            = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + assign_ipv6_address_on_creation                = false
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone                              = "us-east-1a"
03:11:12.728 STDOUT [vpc] terraform:           + availability_zone_id                           = (known after apply)
03:11:12.728 STDOUT [vpc] terraform:           + cidr_block                                     = "10.0.101.0/24"
03:11:12.728 STDOUT [vpc] terraform:           + customer_owned_ipv4_pool                       = null
03:11:12.729 STDOUT [vpc] terraform:           + enable_dns64                                   = false
03:11:12.729 STDOUT [vpc] terraform:           + enable_lni_at_device_index                     = null
03:11:12.729 STDOUT [vpc] terraform:           + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.729 STDOUT [vpc] terraform:           + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.729 STDOUT [vpc] terraform:           + id                                             = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_cidr_block                                = null
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_native                                    = false
03:11:12.729 STDOUT [vpc] terraform:           + map_customer_owned_ip_on_launch                = null
03:11:12.729 STDOUT [vpc] terraform:           + map_public_ip_on_launch                        = false
03:11:12.729 STDOUT [vpc] terraform:           + outpost_arn                                    = null
03:11:12.729 STDOUT [vpc] terraform:           + owner_id                                       = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + tags                                           = {
03:11:12.729 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.729 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.729 STDOUT [vpc] terraform:               + Name        = "my-vpc-public-us-east-1a"
03:11:12.729 STDOUT [vpc] terraform:             }
03:11:12.729 STDOUT [vpc] terraform:           + tags_all                                       = {
03:11:12.729 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.729 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.729 STDOUT [vpc] terraform:               + Name        = "my-vpc-public-us-east-1a"
03:11:12.729 STDOUT [vpc] terraform:             }
03:11:12.729 STDOUT [vpc] terraform:           + timeouts                                       = null
03:11:12.729 STDOUT [vpc] terraform:           + vpc_id                                         = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:         },
03:11:12.729 STDOUT [vpc] terraform:       + {
03:11:12.729 STDOUT [vpc] terraform:           + arn                                            = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + assign_ipv6_address_on_creation                = false
03:11:12.729 STDOUT [vpc] terraform:           + availability_zone                              = "us-east-1b"
03:11:12.729 STDOUT [vpc] terraform:           + availability_zone_id                           = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + cidr_block                                     = "10.0.102.0/24"
03:11:12.729 STDOUT [vpc] terraform:           + customer_owned_ipv4_pool                       = null
03:11:12.729 STDOUT [vpc] terraform:           + enable_dns64                                   = false
03:11:12.729 STDOUT [vpc] terraform:           + enable_lni_at_device_index                     = null
03:11:12.729 STDOUT [vpc] terraform:           + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.729 STDOUT [vpc] terraform:           + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.729 STDOUT [vpc] terraform:           + id                                             = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_cidr_block                                = null
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_native                                    = false
03:11:12.729 STDOUT [vpc] terraform:           + map_customer_owned_ip_on_launch                = null
03:11:12.729 STDOUT [vpc] terraform:           + map_public_ip_on_launch                        = false
03:11:12.729 STDOUT [vpc] terraform:           + outpost_arn                                    = null
03:11:12.729 STDOUT [vpc] terraform:           + owner_id                                       = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + tags                                           = {
03:11:12.729 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.729 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.729 STDOUT [vpc] terraform:               + Name        = "my-vpc-public-us-east-1b"
03:11:12.729 STDOUT [vpc] terraform:             }
03:11:12.729 STDOUT [vpc] terraform:           + tags_all                                       = {
03:11:12.729 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.729 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.729 STDOUT [vpc] terraform:               + Name        = "my-vpc-public-us-east-1b"
03:11:12.729 STDOUT [vpc] terraform:             }
03:11:12.729 STDOUT [vpc] terraform:           + timeouts                                       = null
03:11:12.729 STDOUT [vpc] terraform:           + vpc_id                                         = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:         },
03:11:12.729 STDOUT [vpc] terraform:       + {
03:11:12.729 STDOUT [vpc] terraform:           + arn                                            = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + assign_ipv6_address_on_creation                = false
03:11:12.729 STDOUT [vpc] terraform:           + availability_zone                              = "us-east-1c"
03:11:12.729 STDOUT [vpc] terraform:           + availability_zone_id                           = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + cidr_block                                     = "10.0.104.0/24"
03:11:12.729 STDOUT [vpc] terraform:           + customer_owned_ipv4_pool                       = null
03:11:12.729 STDOUT [vpc] terraform:           + enable_dns64                                   = false
03:11:12.729 STDOUT [vpc] terraform:           + enable_lni_at_device_index                     = null
03:11:12.729 STDOUT [vpc] terraform:           + enable_resource_name_dns_a_record_on_launch    = false
03:11:12.729 STDOUT [vpc] terraform:           + enable_resource_name_dns_aaaa_record_on_launch = false
03:11:12.729 STDOUT [vpc] terraform:           + id                                             = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_cidr_block                                = null
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_cidr_block_association_id                 = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + ipv6_native                                    = false
03:11:12.729 STDOUT [vpc] terraform:           + map_customer_owned_ip_on_launch                = null
03:11:12.729 STDOUT [vpc] terraform:           + map_public_ip_on_launch                        = false
03:11:12.729 STDOUT [vpc] terraform:           + outpost_arn                                    = null
03:11:12.729 STDOUT [vpc] terraform:           + owner_id                                       = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + private_dns_hostname_type_on_launch            = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:           + tags                                           = {
03:11:12.729 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.729 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.729 STDOUT [vpc] terraform:               + Name        = "my-vpc-public-us-east-1c"
03:11:12.729 STDOUT [vpc] terraform:             }
03:11:12.729 STDOUT [vpc] terraform:           + tags_all                                       = {
03:11:12.729 STDOUT [vpc] terraform:               + Environment = "dev"
03:11:12.729 STDOUT [vpc] terraform:               + IaC         = "true"
03:11:12.729 STDOUT [vpc] terraform:               + Name        = "my-vpc-public-us-east-1c"
03:11:12.729 STDOUT [vpc] terraform:             }
03:11:12.729 STDOUT [vpc] terraform:           + timeouts                                       = null
03:11:12.729 STDOUT [vpc] terraform:           + vpc_id                                         = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:         },
03:11:12.729 STDOUT [vpc] terraform:     ]
03:11:12.729 STDOUT [vpc] terraform:   + public_subnets                              = [
03:11:12.729 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.729 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.729 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.729 STDOUT [vpc] terraform:     ]
03:11:12.729 STDOUT [vpc] terraform:   + public_subnets_cidr_blocks                  = [
03:11:12.729 STDOUT [vpc] terraform:       + "10.0.101.0/24",
03:11:12.729 STDOUT [vpc] terraform:       + "10.0.102.0/24",
03:11:12.729 STDOUT [vpc] terraform:       + "10.0.104.0/24",
03:11:12.729 STDOUT [vpc] terraform:     ]
03:11:12.729 STDOUT [vpc] terraform:   + public_subnets_ipv6_cidr_blocks             = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_public_route_table_association_ids = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_route_table_association_ids        = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_route_table_ids                    = [
03:11:12.729 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.729 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.729 STDOUT [vpc] terraform:       + (known after apply),
03:11:12.729 STDOUT [vpc] terraform:     ]
03:11:12.729 STDOUT [vpc] terraform:   + redshift_subnet_arns                        = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_subnet_objects                     = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_subnets                            = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_subnets_cidr_blocks                = []
03:11:12.729 STDOUT [vpc] terraform:   + redshift_subnets_ipv6_cidr_blocks           = []
03:11:12.729 STDOUT [vpc] terraform:   + this_customer_gateway                       = {}
03:11:12.729 STDOUT [vpc] terraform:   + vpc_arn                                     = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:   + vpc_cidr_block                              = "10.0.0.0/16"
03:11:12.729 STDOUT [vpc] terraform:   + vpc_enable_dns_hostnames                    = true
03:11:12.729 STDOUT [vpc] terraform:   + vpc_enable_dns_support                      = true
03:11:12.729 STDOUT [vpc] terraform:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
03:11:12.729 STDOUT [vpc] terraform:   + vpc_flow_log_destination_arn                = ""
03:11:12.729 STDOUT [vpc] terraform:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
03:11:12.729 STDOUT [vpc] terraform:   + vpc_id                                      = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:   + vpc_instance_tenancy                        = "default"
03:11:12.729 STDOUT [vpc] terraform:   + vpc_ipv6_association_id                     = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:   + vpc_ipv6_cidr_block                         = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:   + vpc_main_route_table_id                     = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:   + vpc_owner_id                                = (known after apply)
03:11:12.729 STDOUT [vpc] terraform:   + vpc_secondary_cidr_blocks                   = []
```

</details>
    
